# Лабораторная работа №6
## Задача
### Разобраться в работе с `itertools`
#### Вариант №5
## Ход работы:
1. Разобрать работу модуля итерации.
2. Написать программы для своего варианта.
3. Готовые решения загрузить в репозиторий на `github`.
### Задание №1
Вася составляет 6-буквенные слова, в которых могут быть использованы только буквы В, И, Ш, Н, Я, причём буква В используется не более одного раза. Каждая из других допустимых букв может встречаться в слове любое количество раз или не встречаться совсем. Слово не должно начинаться с буквы Ш и оканчиваться гласными буквами. Словом считается любая допустимая последовательность букв, не обязательно осмысленная. Сколько существует таких слов, которые может написать Вася?
#### Решение:

```
from itertools import *

c=0
for i in product('вишня', repeat=6):
    if i.count('в')<=1 and i[0]!='ш' and i[5]!='и' and i[5]!='я':
        c+=1
print(c)
```
Ответ: **4352**
### Задание №2
Сколько единиц содержится в двоичной записи значения выражения 4^2014+2^2015-8?
#### Решение:

```
a=4**2014+2**2015-8
b=bin(a)[2:]
print(b.count('1'))
```
Ответ: **2013**

### Задание №3
Найдите все натуральные числа N, принадлежащие отрезку [400 000 000; 600 000 000], которые можно представить в виде N=2^m*3^n, где m - чётное число, n - нечётное число. Выведите все найденные числа в порядке возрастания.
#### Решение:

```
a=[]
for m in range(0,30,2):
    for n in range(1,20,2):
        x=2**m * 3**n
        if 400000000 <= x <= 600000000:
            a.append(x)
print(*sorted(a))
```
Ответ: **408146688 452984832 516560652 573308928**
## Источники
[evil-teacher](https://evil-teacher.on-fleek.app/prog_pm/term1/lab06/)
